[
  {
    "type":  "attack-pattern",
    "typeql": "attack-pattern",
    "class": "AttackPattern",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_axjijf603msy",
    "doc_url": "Attack-Pattern.md",
    "summary": "Attack Patterns are a type of TTP that describe ways that adversaries attempt to compromise targets. Attack Patterns are used to help categorize attacks, generalize specific attacks to the patterns that they follow, and provide detailed information about how attacks are performed. An example of an attack pattern is \"spear phishing\": a common type of attack where an attacker sends a carefully crafted e-mail message to a party with the intent of getting them to click a link or open an attachment to deliver malware. Attack Patterns can also be more specific; spear phishing as practiced by a particular threat actor (e.g., they might generally say that the target won a contest) can also be an Attack Pattern.",
    "protocol": "stix21",
    "icon": "stix2_attack_pattern_icon_tiny_round_v1.png"
  },
  {
    "type":  "campaign",
    "typeql": "campaign",
    "class": "Campaign",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_pcpvfz4ik6d6",
    "doc_url": "Campaign.md",
    "summary": "A Campaign is a grouping of adversarial behaviors that describes a set of malicious activities or attacks (sometimes called waves) that occur over a period of time against a specific set of targets. Campaigns usually have well defined objectives and may be part of an Intrusion Set. Campaigns are often attributed to an intrusion set and threat actors. The threat actors may reuse known infrastructure from the intrusion set or may set up new infrastructure specific for conducting that campaign.Campaigns can be characterized by their objectives and the incidents they cause, people or resources they target, and the resources (infrastructure, intelligence, Malware, Tools, etc.) they use.",
    "protocol": "stix21",
    "icon": "stix2_campaign_icon_tiny_round_v1.png"
  },
  {
    "type":  "course-of-action",
    "typeql": "course-of-action",
    "class": "CourseOfAction",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_a925mpw39txn",
    "doc_url": "Course-of-Action.md",
    "summary": "Note: The Course of Action object in STIX 2.1 is a stub. It is included to support basic use cases (such as sharing prose courses of action) but does not support the ability to represent automated courses of action or contain properties to represent metadata about courses of action. Future STIX 2 releases will expand it to include these capabilities.A Course of Action is an action taken either to prevent an attack or to respond to an attack that is in progress. It may describe technical, automatable responses (applying patches, reconfiguring firewalls) but can also describe higher level actions like employee training or policy changes. For example, a course of action to mitigate a vulnerability could describe applying the patch that fixes it.",
    "protocol": "stix21",
    "icon": "stix2_course_of_action_icon_tiny_round_v1.png"
  },
  {
    "type":  "grouping",
    "typeql": "grouping",
    "class": "Grouping",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_t56pn7elv6u7",
    "doc_url": "Grouping.md",
    "summary": "A Grouping object explicitly asserts that the referenced STIX Objects have a shared context, unlike a STIX Bundle (which explicitly conveys no context). A Grouping object should not be confused with an intelligence product, which should be conveyed via a STIX Report. A STIX Grouping object might represent a set of data that, in time, given sufficient analysis, would mature to convey an incident or threat report as a STIX Report object. For example, a Grouping could be used to characterize an ongoing investigation into a security event or incident. A Grouping object could also be used to assert that the referenced STIX Objects are related to an ongoing analysis process, such as when a threat analyst is collaborating with others in their trust community to examine a series of Campaigns and Indicators. The Grouping SDO contains a list of references to SDOs, SCOs, SROs, and SMOs, along with an explicit statement of the context shared by the content, a textual description, and the name of the grouping.",
    "protocol": "stix21",
    "icon": "stix2_grouping_icon_tiny_round_v1.png"
  },
  {
    "type":  "identity",
    "typeql": "identity",
    "class": "Identity",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_wh296fiwpklp",
    "doc_url": "Identity.md",
    "summary": "Identities can represent actual individuals, organizations, or groups (e.g., ACME, Inc.) as well as classes of individuals, organizations, systems or groups (e.g., the finance sector). The Identity SDO can capture basic identifying information, contact information, and the sectors that the Identity belongs to. Identity is used in STIX to represent, among other things, targets of attacks, information sources, object creators, and threat actor identities.",
    "protocol": "stix21",
    "icon": "stix2_identity_icon_tiny_round_v1.png"
  },
  {
    "type":  "marking-definition",
    "typeql": "marking-definition",
    "class": "MarkingDefinition",
    "object": "meta",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_k5fndj2c7c1k",
    "doc_url": "",
    "summary": "",
    "protocol": "stix21",
    "icon": "stix2_marking_definition_icon_tiny_round_v1.png"
  },
  {
    "type":  "incident",
    "typeql": "incident",
    "class": "Incident",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_sczfhw64pjxt",
    "doc_url": "Incident.md",
    "summary": "Note: The Incident object in STIX 2.1 is a stub. It is included to support basic use cases but does not contain properties to represent metadata about incidents. Future STIX 2 releases will expand it to include these capabilities.  It is suggested that it is used as an extension point for an Incident object defined using the extension facility described in section 7.3",
    "protocol": "stix21",
    "icon": "stix2_incident_icon_tiny_round_v1.png"
  },
  {
    "type":  "indicator",
    "typeql": "indicator",
    "class": "Indicator",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_muftrcpnf89v",
    "doc_url": "Indicator.md",
    "summary": "ndicators contain a pattern that can be used to detect suspicious or malicious cyber activity. For example, an Indicator may be used to represent a set of malicious domains and use the STIX Patterning Language (see section 9) to specify these domains.The Indicator SDO contains a simple textual description, the Kill Chain Phases that it detects behavior in, a time window for when the Indicator is valid or useful, and a required pattern property to capture a structured detection pattern. Conforming STIX implementations MUST support the STIX Patterning Language as defined in section 9. Relationships from the Indicator can describe the malicious or suspicious behavior that it directly detects (Malware, Tool, and Attack Pattern). In addition, it may also imply the presence of a Campaigns, Intrusion Sets, and Threat Actors, etc.",
    "protocol": "stix21",
    "icon": "stix2_indicator_icon_tiny_round_v1.png"
  },
  {
    "type":  "infrastructure",
    "typeql": "infrastructure",
    "class": "Infrastructure",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_jo3k1o6lr9",
    "doc_url": "Infrastructure.md",
    "summary": "The Infrastructure SDO represents a type of TTP and describes any systems, software services and any associated physical or virtual resources intended to support some purpose (e.g., C2 servers used as part of an attack, device or server that are part of defense, database servers targeted by an attack, etc.). While elements of an attack can be represented by other SDOs or SCOs, the Infrastructure SDO represents a named group of related data that constitutes the infrastructure.",
    "protocol": "stix21",
    "icon": "stix2_infrastructure_icon_tiny_round_v1.png"
  },
  {
    "type":  "intrusion-set",
    "typeql": "intrusion-set",
    "class": "IntrusionSet",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_5ol9xlbbnrdn",
    "doc_url": "Intrusion-Set.md",
    "summary": "An Intrusion Set is a grouped set of adversarial behaviors and resources with common properties that is believed to be orchestrated by a single organization. An Intrusion Set may capture multiple Campaigns or other activities that are all tied together by shared attributes indicating a commonly known or unknown Threat Actor. New activity can be attributed to an Intrusion Set even if the Threat Actors behind the attack are not known. Threat Actors can move from supporting one Intrusion Set to supporting another, or they may support multiple Intrusion Sets.  Where a Campaign is a set of attacks over a period of time against a specific set of targets to achieve some objective, an Intrusion Set is the entire attack package and may be used over a very long period of time in multiple Campaigns to achieve potentially multiple purposes.  While sometimes an Intrusion Set is not active, or changes focus, it is usually difficult to know if it has truly disappeared or ended. Analysts may have varying level of fidelity on attributing an Intrusion Set back to Threat Actors and may be able to only attribute it back to a nation state or perhaps back to an organization within that nation state.",
    "protocol": "stix21",
    "icon": "stix2_intrusion_set_icon_tiny_round_v1.png"
  },
  {
    "type":  "location",
    "typeql": "location",
    "class": "Location",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_th8nitr8jb4k",
    "doc_url": "Location.md",
    "summary": "A Location represents a geographic location. The location may be described as any, some or all of the following: region (e.g., North America), civic address (e.g. New York, US), latitude and longitude.  Locations are primarily used to give context to other SDOs. For example, a Location could be used in a relationship to describe that the Bourgeois Swallow intrusion set originates from Eastern Europe. The Location SDO can be related to an Identity or Intrusion Set to indicate that the identity or intrusion set is located in that location. It can also be related from a malware or attack pattern to indicate that they target victims in that location. The Location object describes geographic areas, not governments, even in cases where that area might have a government. For example, a Location representing the United States describes the United States as a geographic area, not the federal government of the United States.  ",
    "protocol": "stix21",
    "icon": "stix2_location_icon_tiny_round_v1.png"
  },
  {
    "type":  "malware",
    "typeql": "malware",
    "class": "Malware",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_s5l7katgbp09",
    "doc_url": "Malware.md",
    "summary": "Malware is a type of TTP that represents malicious code. It generally refers to a program that is inserted into a system, usually covertly. The intent is to compromise the confidentiality, integrity, or availability of the victim's data, applications, or operating system (OS) or otherwise annoy or disrupt the victim.  The Malware SDO characterizes, identifies, and categorizes malware instances and families from data that may be derived from analysis. This SDO captures detailed information about how the malware works and what it does. This SDO captures contextual data relevant to sharing Malware data without requiring the full analysis provided by the Malware Analysis SDO.  The Indicator SDO provides intelligence producers with the ability to define, using the STIX Pattern Grammar in a standard way to identify and detect behaviors associated with malicious activities. Although the Malware SDO provides vital intelligence on a specific instance or malware family, it does not provide a standard grammar that the Indicator SDO provides to identify those properties in security detection systems designed to process the STIX Pattern grammar. ",
    "protocol": "stix21",
    "icon": "stix2_malware_icon_tiny_round_v1.png"
  },
  {
    "type":  "malware-analysis",
    "typeql": "malware-analysis",
    "class": "MalwareAnalysis",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_6hdrixb3ua4j",
    "doc_url": "Malware-Analysis.md",
    "summary": "Malware Analysis captures the metadata and results of a particular static or dynamic analysis performed on a malware instance or family. One of result or analysis_sco_refs properties MUST be provided.",
    "protocol": "stix21",
    "icon": "stix2_malware_analysis_icon_tiny_round_v1.png"
  },
  {
    "type":  "note",
    "typeql": "note",
    "class": "Note",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_gudodcg1sbb9",
    "doc_url": "Note.md",
    "summary": "A Note is intended to convey informative text to provide further context and/or to provide additional analysis not contained in the STIX Objects, Marking Definition objects, or Language Content objects which the Note relates to. Notes can be created by anyone (not just the original object creator).  For example, an analyst may add a Note to a Campaign object created by another organization indicating that they've seen posts related to that Campaign on a hacker forum.  Because Notes are typically (though not always) created by human analysts and are comprised of human-oriented text, they contain an additional property to capture the analyst(s) that created the Note. This is distinct from the created_by_ref property, which is meant to capture the organization that created the object.",
    "protocol": "stix21",
    "icon": "stix2_note_icon_tiny_round_v1.png"
  },
  {
    "type":  "observed-data",
    "typeql": "observed-data",
    "class": "ObservedData",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_p49j1fwoxldc",
    "doc_url": "Observed-Data.md",
    "summary": "Observed Data conveys information about cyber security related entities such as files, systems, and networks using the STIX Cyber-observable Objects (SCOs). For example, Observed Data can capture information about an IP address, a network connection, a file, or a registry key. Observed Data is not an intelligence assertion, it is simply the raw information without any context for what it means. Observed Data can capture that a piece of information was seen one or more times. Meaning, it can capture both a single observation of a single entity (file, network connection) as well as the aggregation of multiple observations of an entity. When the number_observed property is 1 the Observed Data represents a single entity. When the number_observed property is greater than 1, the Observed Data represents several instances of an entity potentially collected over a period of time. If a time window is known, that can be captured using the first_observed and last_observed properties. When used to collect aggregate data, it is likely that some properties in the SCO (e.g., timestamp properties) will be omitted because they would differ for each of the individual observations.",
    "protocol": "stix21",
    "icon": "stix2_observed_data_icon_tiny_round_v1.png"
  },
  {
    "type":  "opinion",
    "typeql": "opinion",
    "class": "Opinion",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_ht1vtzfbtzda",
    "doc_url": "Opinion.md",
    "summary": "An Opinion is an assessment of the correctness of the information in a STIX Object produced by a different entity. The primary property is the opinion property, which captures the level of agreement or disagreement using a fixed scale. That fixed scale also supports a numeric mapping to allow for consistent statistical operations across opinions. For example, an analyst from a consuming organization might say that they \"strongly disagree\" with a Campaign object and provide an explanation about why. In a more automated workflow, a SOC operator might give an Indicator \"one star\" in their TIP (expressing \"strongly disagree\") because it is considered to be a false positive within their environment. Opinions are subjective, and the specification does not address how best to interpret them. Sharing communities are encouraged to provide clear guidelines to their constituents regarding best practice for the use of Opinion objects within the community.",
    "protocol": "stix21",
    "icon": "stix2_opinion_icon_tiny_round_v1.png"
  },
  {
    "type":  "report",
    "typeql": "report",
    "class": "Report",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_n8bjzg1ysgdq",
    "doc_url": "Report.md",
    "summary": "Reports are collections of threat intelligence focused on one or more topics, such as a description of a threat actor, malware, or attack technique, including context and related details. They are used to group related threat intelligence together so that it can be published as a comprehensive cyber threat story. The Report SDO contains a list of references to STIX Objects (the CTI objects included in the report) along with a textual description and the name of the report. For example, a threat report produced by ACME Defense Corp. discussing the Glass Gazelle campaign should be represented using Report. The Report itself would contain the narrative of the report while the Campaign SDO and any related SDOs (e.g., Indicators for the Campaign, Malware it uses, and the associated Relationships) would be referenced in the report contents.",
    "protocol": "stix21",
    "icon": "stix2_report_icon_tiny_round_v1.png"
  },
  {
    "type":  "threat-actor",
    "typeql": "threat-actor",
    "class": "ThreatActor",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_k017w16zutw",
    "doc_url": "Threat-Actor.md",
    "summary": "Threat Actors are actual individuals, groups, or organizations believed to be operating with malicious intent. A Threat Actor is not an Intrusion Set but may support or be affiliated with various Intrusion Sets, groups, or organizations over time.  Threat Actors leverage their resources, and possibly the resources of an Intrusion Set, to conduct attacks and run Campaigns against targets.  Threat Actors can be characterized by their motives, capabilities, goals, sophistication level, past activities, resources they have access to, and their role in the organization.",
    "protocol": "stix21",
    "icon": "stix2_report_icon_tiny_round_v1.png"
  },
  {
    "type":  "tool",
    "typeql": "tool",
    "class": "Tool",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_z4voa9ndw8v",
    "doc_url": "Tool.md",
    "summary": "Tools are legitimate software that can be used by threat actors to perform attacks. Knowing how and when threat actors use such tools can be important for understanding how campaigns are executed. Unlike malware, these tools or software packages are often found on a system and have legitimate purposes for power users, system administrators, network administrators, or even normal users. Remote access tools (e.g., RDP) and network scanning tools (e.g., Nmap) are examples of Tools that may be used by a Threat Actor during an attack.  The Tool SDO characterizes the properties of these software tools and can be used as a basis for making an assertion about how a Threat Actor uses them during an attack. It contains properties to name and describe the tool, a list of Kill Chain Phases the tool can be used to carry out, and the version of the tool.  This SDO MUST NOT be used to characterize malware. Further, Tool MUST NOT be used to characterize tools used as part of a course of action in response to an attack.",
    "protocol": "stix21",
    "icon": "stix2_tool_icon_tiny_round_v1.png"
  },
  {
    "type":  "vulnerability",
    "typeql": "vulnerability",
    "class": "Vulnerability",
    "object": "sdo",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_q5ytzmajn6re",
    "doc_url": "Vulnerability.md",
    "summary": "A Vulnerability is a weakness or defect in the requirements, designs, or implementations of the computational logic (e.g., code) found in software and some hardware components (e.g., firmware) that can be directly exploited to negatively impact the confidentiality, integrity, or availability of that system.  CVE is a list of information security vulnerabilities and exposures that provides common names for publicly known problems [CVE]. For example, if a piece of malware exploits CVE-2015-12345, a Malware object could be linked to a Vulnerability object that references CVE-2015-12345.  The Vulnerability SDO is primarily used to link to external definitions of vulnerabilities or to describe 0-day vulnerabilities that do not yet have an external definition. Typically, other SDOs assert relationships to Vulnerability objects when a specific vulnerability is targeted and exploited as part of malicious cyber activity. As such, Vulnerability objects can be used as a linkage to the asset management and compliance process.",
    "protocol": "stix21",
    "icon": "stix2_vulnerability_icon_tiny_round_v1.png"
  },
  {
    "type":  "artifact",
    "typeql": "artifact",
    "class": "Artifact",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_4jegwl6ojbes",
    "doc_url": "Artifact.md",
    "summary": "A Vulnerability is a weakness or defect in the requirements, designs, or implementations of the computational logic (e.g., code) found in software and some hardware components (e.g., firmware) that can be directly exploited to negatively impact the confidentiality, integrity, or availability of that system.  CVE is a list of information security vulnerabilities and exposures that provides common names for publicly known problems [CVE]. For example, if a piece of malware exploits CVE-2015-12345, a Malware object could be linked to a Vulnerability object that references CVE-2015-12345.  The Vulnerability SDO is primarily used to link to external definitions of vulnerabilities or to describe 0-day vulnerabilities that do not yet have an external definition. Typically, other SDOs assert relationships to Vulnerability objects when a specific vulnerability is targeted and exploited as part of malicious cyber activity. As such, Vulnerability objects can be used as a linkage to the asset management and compliance process.",
    "protocol": "stix21",
    "icon": "stix2_artifact_icon_tiny_round_v1.png"
  },
  {
    "type":  "autonomous-system",
    "typeql": "autonomous-system",
    "class": "AutonomousSystem",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_27gux0aol9e3",
    "doc_url": "Autonomous-System.md",
    "summary": "This object represents the properties of an Autonomous System (AS).",
    "protocol": "stix21",
    "icon": "stix2_autonomous_system_icon_tiny_round_v1.png"
  },
  {
    "type":  "directory",
    "typeql": "directory",
    "class": "Directory",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_lyvpga5hlw52",
    "doc_url": "Directory.md",
    "summary": "The Directory object represents the properties common to a file system directory.",
    "protocol": "stix21",
    "icon": "stix2_directory_icon_tiny_round_v1.png"
  },
  {
    "type":  "domain-name",
    "typeql": "domain-name",
    "class": "DomainName",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_prhhksbxbg87",
    "doc_url": "Domain-Name.md",
    "summary": "The Domain Name object represents the properties of a network domain name.",
    "protocol": "stix21",
    "icon": "stix2_domain_name_icon_tiny_round_v1.png"
  },
  {
    "type":  "email-addr",
    "typeql": "email-addr",
    "class": "EmailAddress",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_wmenahkvqmgj",
    "doc_url": "Email-Address.md",
    "summary": "The Email Address object represents a single email address.",
    "protocol": "stix21",
    "icon": "stix2_email_addr_icon_tiny_round_v1.png"
  },
  {
    "type":  "email-message",
    "typeql": "email-message",
    "class": "EmailMessage",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_grboc7sq5514",
    "doc_url": "Email-Message.md",
    "summary": "The Email Message object represents an instance of an email message, corresponding to the internet message format described in [RFC5322] and related RFCs.  Header field values that have been encoded as described in section 2 of [RFC2047] MUST be decoded before inclusion in Email Message object properties. For example, this is some text MUST be used instead of =?iso-8859-1?q?this=20is=20some=20text?=. Any characters in the encoded value which cannot be decoded into Unicode SHOULD be replaced with the 'REPLACEMENT CHARACTER' (U+FFFD). If it is necessary to capture the header value as observed, this can be achieved by referencing an Artifact object through the raw_email_ref property.",
    "protocol": "stix21",
    "icon": "stix2_email_message_icon_tiny_round_v1.png"
  },
  {
    "type":  "file",
    "typeql": "file",
    "class": "File",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_99bl2dibcztv",
    "doc_url": "File.md",
    "summary": "The File object represents the properties of a file. A File object MUST contain at least one of hashes or name.",
    "protocol": "stix21",
    "icon": "stix2_file_icon_tiny_round_v1.png"
  },
  {
    "type":  "ipv4-addr",
    "typeql": "ipv4-addr",
    "class": "IPv4Address",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_ki1ufj1ku8s0",
    "doc_url": "IPv4-Address.md",
    "summary": "The IPv4 Address object represents one or more IPv4 addresses expressed using CIDR notation.",
    "protocol": "stix21",
    "icon": "stix2_ipv4_addr_icon_tiny_round_v1.png"
  },
  {
    "type":  "ipv6-addr",
    "typeql": "ipv6-addr",
    "class": "IPv6Address",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_oeggeryskriq",
    "doc_url": "IPv6-Address.md",
    "summary": "The IPv6 Address object represents one or more IPv6 addresses expressed using CIDR notation.",
    "protocol": "stix21",
    "icon": "stix2_ipv6_addr_icon_tiny_round_v1.png"
  },
  {
    "type":  "mac-addr",
    "typeql": "mac-addr",
    "class": "MACAddress",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_f92nr9plf58y",
    "doc_url": "MAC-Address.md",
    "summary": "The MAC Address object represents a single Media Access Control (MAC) address.",
    "protocol": "stix21",
    "icon": "stix2_mac_addr_icon_tiny_round_v1.png"
  },
  {
    "type":  "mutex",
    "typeql": "mutex",
    "class": "Mutex",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_84hwlkdmev1w",
    "doc_url": "Mutex.md",
    "summary": "The Mutex object represents the properties of a mutual exclusion (mutex) object.",
    "protocol": "stix21",
    "icon": "stix2_mutex_icon_tiny_round_v1.png"
  },
  {
    "type":  "network-traffic",
    "typeql": "network-traffic",
    "class": "NetworkTraffic",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_rgnc3w40xy",
    "doc_url": "Network-Traffic.md",
    "summary": "The Network Traffic object represents arbitrary network traffic that originates from a source and is addressed to a destination. The network traffic MAY or MAY NOT constitute a valid unicast, multicast, or broadcast network connection. This MAY also include traffic that is not established, such as a SYN flood.  To allow for use cases where a source or destination address may be sensitive and not suitable for sharing, such as addresses that are internal to an organization’s network, the source and destination properties (src_ref and dst_ref, respectively) are defined as optional in the properties table below. However, a Network Traffic object MUST contain the protocols property and at least one of the src_ref or dst_ref properties and SHOULD contain the src_port and dst_port properties.",
    "protocol": "stix21",
    "icon": "stix2_network_traffic_icon_tiny_round_v1.png"
  },
  {
    "type":  "process",
    "typeql": "process",
    "class": "Process",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_hpppnm86a1jm",
    "doc_url": "Process.md",
    "summary": "The Process object represents common properties of an instance of a computer program as executed on an operating system. A Process object MUST contain at least one property (other than type) from this object (or one of its extensions).",
    "protocol": "stix21",
    "icon": "stix2_process_icon_tiny_round_v1.png"
  },
  {
    "type":  "software",
    "typeql": "software",
    "class": "Software",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_7rkyhtkdthok",
    "doc_url": "Software.md",
    "summary": "The Software object represents high-level properties associated with software, including software products.",
    "protocol": "stix21",
    "icon": "stix2_software_icon_tiny_round_v1.png"
  },
  {
    "type":  "url",
    "typeql": "url",
    "class": "URL",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_ah3hict2dez0",
    "doc_url": "URL.md",
    "summary": "The URL object represents the properties of a uniform resource locator (URL).",
    "protocol": "stix21",
    "icon": "stix2_url_icon_tiny_round_v1.png"
  },
  {
    "type":  "user-account",
    "typeql": "user-account",
    "class": "UserAccount",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_azo70vgj1vm2",
    "doc_url": "User-Account.md",
    "summary": "The User Account object represents an instance of any type of user account, including but not limited to operating system, device, messaging service, and social media platform accounts. As all properties of this object are optional, at least one of the properties defined below MUST be included when using this object.",
    "protocol": "stix21",
    "icon": "stix2_user_account_icon_tiny_round_v1.png"
  },
  {
    "type":  "windows-registry-key",
    "typeql": "windows-registry-key",
    "class": "WindowsRegistryKey",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_luvw8wjlfo3y",
    "doc_url": "Windows-Regaistry-Key.md",
    "summary": "The Registry Key object represents the properties of a Windows registry key. As all properties of this object are optional, at least one of the properties defined below MUST be included when using this object.",
    "protocol": "stix21",
    "icon": "stix2_windows_registry_key_icon_tiny_round_v1.png"
  },
  {
    "type":  "x509-certificate",
    "typeql": "x509-certificate",
    "class": "X509Certificate",
    "object": "sco",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_8abcy1o5x9w1",
    "doc_url": "X.509-Certificate.md",
    "summary": "The X.509 Certificate object represents the properties of an X.509 certificate, as defined by ITU recommendation X.509 [X.509]. An X.509 Certificate object MUST contain at least one object specific property (other than type) from this object.",
    "protocol": "stix21",
    "icon": "stix2_x509_certificate_icon_tiny_round_v1.png"
  },
  {
    "type":  "relationship",
    "typeql": "stix-core-relationship",
    "class": "Relationship",
    "object": "sro",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_cqhkqvhnlgfh",
    "doc_url": "",
    "summary": "The Relationship object is used to link together two SDOs or SCOs in order to describe how they are related to each other. If SDOs and SCOs are considered \"nodes\" or \"vertices\" in the graph, the Relationship Objects (SROs) represent \"edges\".  STIX defines many relationship types to link together SDOs and SCOs. These relationships are contained in the \"Relationships\" table under each SDO and SCO definition. Relationship types defined in the specification SHOULD be used to ensure consistency. An example of a specification-defined relationship is that an indicator indicates a campaign. That relationship type is listed in the Relationships section of the Indicator SDO definition.  STIX also allows relationships from any SDO or SCO to any SDO or SCO that have not been defined in this specification. These relationships MAY use the related-to relationship type or MAY use a user-defined relationship type. As an example, a user might want to link malware directly to a tool. They can do so using related-to to say that the Malware is related to the Tool but not describe how, or they could use delivered-by (a user-defined name they determined) to indicate more detail.  Note that some relationships in STIX may seem like \"shortcuts\". For example, an Indicator doesn't really detect a Campaign: it detects activity (Attack Patterns, Malware, Infrastructure, etc.) that are often used by that campaign. While some analysts might want all of the source data and think that shortcuts are misleading, in many cases it's helpful to provide just the key points (shortcuts) and leave out the low-level details. In other cases, the low-level analysis may not be known or sharable, while the high-level analysis is. For these reasons, relationships that might appear to be \"shortcuts\" are not excluded from STIX.",
    "protocol": "stix21",
    "icon": "stix2_relationship_icon_tiny_round_v1.png"
  },
  {
    "type":  "sighting",
    "typeql": "sighting",
    "class": "Sighting",
    "object": "sro",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_a795guqsap3r",
    "doc_url": "",
    "summary": "A Sighting denotes the belief that something in CTI (e.g., an indicator, malware, tool, threat actor, etc.) was seen. Sightings are used to track who and what are being targeted, how attacks are carried out, and to track trends in attack behavior. The Sighting relationship object is a special type of SRO; it is a relationship that contains extra properties not present on the Generic Relationship object. These extra properties are included to represent data specific to sighting relationships (e.g., count, representing how many times something was seen), but for other purposes a Sighting can be thought of as a Relationship with a name of \"sighting-of\". Sighting is captured as a relationship because you cannot have a sighting unless you have something that has been sighted. Sighting does not make sense without the relationship to what was sighted.",
    "protocol": "stix21",
    "icon": "stix2_sighting_icon_tiny_round_v1.png"
  },
  {
    "type":  "alternate-data-stream",
    "typeql": "alternate-data-stream",
    "class": "",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_8i2ts0xicqea",
    "doc_url": "File-NTFS.md",
    "summary": "he Alternate Data Stream type represents an NTFS alternate data stream.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "archive-ext",
    "typeql": "archive-ext",
    "class": "ArchiveExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_xi3g7dwaigs6",
    "doc_url": "File-Archive.md",
    "summary": "The Archive File extension specifies a default extension for capturing properties specific to archive files. The key for this extension when used in the extensions dictionary MUST be archive-ext. Note that this predefined extension does not use the extension facility described in section 7.3.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "email-mime-part",
    "typeql": "email-mime-part",
    "class": "",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_qpo5x7d8mefq",
    "doc_url": "Email-MIME-Component.md",
    "summary": "Specifies one component of a multi-part email body.  There is no property to capture the value of the \"Content-Transfer-Encoding\" header field, since the body MUST be decoded before being represented in the body property.  One of body OR body_raw_ref MUST be included.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "external-reference",
    "typeql": "external-reference",
    "class": "",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_72bcfr3t79jx",
    "doc_url": "",
    "summary": "External references are used to describe pointers to information represented outside of STIX. For example, a Malware object could use an external reference to indicate an ID for that malware in an external database or a report could use references to represent source material. The JSON MTI serialization uses the JSON Object type [RFC8259] when representing external-reference.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "hash_typeql_dict",
    "typeql": "hash_typeql_dict",
    "class": "",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_odoabbtwuxyd",
    "doc_url": "",
    "summary": "The Hashes type represents one or more cryptographic hashes, as a special set of key/value pairs. Accordingly, the name of each hashing algorithm MUST be specified as a key in the dictionary and MUST identify the name of the hashing algorithm used to generate the corresponding value. This name SHOULD come from one of the values defined in the hash-algorithm-ov open vocabulary. Dictionary keys MUST be unique in each hashes property, MUST be in ASCII, and are limited to the characters a-z (lowercase ASCII), A-Z (uppercase ASCII), numerals 0-9, hyphen (-), and underscore (_). Dictionary keys MUST have a minimum length of 3 ASCII characters and MUST be no longer than 250 ASCII characters in length. The value MUST be a string in the appropriate format defined by the hash type indicated in the dictionary key.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "http-request-ext",
    "typeql": "http-request-ext",
    "class": "HTTPRequestExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_b0e376hgtml8",
    "doc_url": "Network-HTTP.md",
    "summary": "The HTTP request extension specifies a default extension for capturing network traffic properties specific to HTTP requests. The key for this extension when used in the extensions dictionary MUST be http-request-ext. Note that this predefined extension does not use the extension facility described in section 7.3. The corresponding protocol value for this extension is http.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "icmp-ext",
    "typeql": "icmp-ext",
    "class": "ICMPExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_ozypx0lmkebv",
    "doc_url": "Network-ICMP.md",
    "summary": "The ICMP extension specifies a default extension for capturing network traffic properties specific to ICMP. The key for this extension when used in the extensions dictionary MUST be icmp-ext. Note that this predefined extension does not use the extension facility described in section 7.3. The corresponding protocol value for this extension is icmp.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "kill-chain-phase",
    "typeql": "kill-chain-phase",
    "class": "",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_i4tjv75ce50h",
    "doc_url": "",
    "summary": "The kill-chain-phase represents a phase in a kill chain, which describes the various phases an attacker may undertake in order to achieve their objectives. The JSON MTI serialization uses the JSON Object type [RFC8259] when representing kill-chain-phase.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "ntfs-ext",
    "typeql": "ntfs-ext",
    "class": "NTFSExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_o6cweepfrsci",
    "doc_url": "File-NTFS.md",
    "summary": "The NTFS file extension specifies a default extension for capturing properties specific to the storage of the file on the NTFS file system. The key for this extension when used in the extensions dictionary MUST be ntfs-ext. Note that this predefined extension does not use the extension facility described in section 7.3. An object using the NTFS File Extension MUST contain at least one property from this extension.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "pdf-ext",
    "typeql": "pdf-ext",
    "class": "PDFExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_8xmpb2ghp9km",
    "doc_url": "File-PDF",
    "summary": "The PDF file extension specifies a default extension for capturing properties specific to PDF files. The key for this extension when used in the extensions dictionary MUST be pdf-ext. Note that this predefined extension does not use the extension facility described in section 7.3. An object using the PDF File Extension MUST contain at least one property from this extension.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "raster-image-ext",
    "typeql": "raster-image-ext",
    "class": "RasterImageExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_u5z7i2ox8w4x",
    "doc_url": "File-Raster-Image.md",
    "summary": "The Raster Image file extension specifies a default extension for capturing properties specific to raster image files. The key for this extension when used in the extensions dictionary MUST be raster-image-ext. Note that this predefined extension does not use the extension facility described in section 7.3. An object using the Raster Image File Extension MUST contain at least one property from this extension.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "socket-ext",
    "typeql": "socket-ext",
    "class": "SocketExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_8jamupj9ubdv",
    "doc_url": "Network-Socket.md",
    "summary": "The Network Socket extension specifies a default extension for capturing network traffic properties associated with network sockets. The key for this extension when used in the extensions dictionary MUST be socket-ext. Note that this predefined extension does not use the extension facility described in section 7.3.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "tcp-ext",
    "typeql": "tcp-ext",
    "class": "TCPExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_k2njqio7f142",
    "doc_url": "Network-TCP.md",
    "summary": "The TCP extension specifies a default extension for capturing network traffic properties specific to TCP. The key for this extension when used in the extensions dictionary MUST be tcp-ext. Note that this predefined extension does not use the extension facility described in section 7.3. The corresponding protocol value for this extension is tcp.An object using the TCP Extension MUST contain at least one property from this extension.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "unix-account-ext",
    "typeql": "unix-account-ext",
    "class": "UNIXAccountExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_hodiamlggpw5",
    "doc_url": "User-UNIX-Account.md",
    "summary": "The UNIX account extension specifies a default extension for capturing the additional information for an account on a UNIX system. The key for this extension when used in the extensions dictionary MUST be unix-account-ext. Note that this predefined extension does not use the extension facility described in section 7.3. An object using the UNIX Account Extension MUST contain at least one property from this extension.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "windows-pe-optional-header-type",
    "typeql": "windows-pe-optional-header-type",
    "class": "",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_29l09w731pzc",
    "doc_url": "File-Windows-PE-Binary.md",
    "summary": "The Windows PE Optional Header type represents the properties of the PE optional header. An object using the Windows PE Optional Header Type MUST contain at least one property from this type.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "windows-pe-section",
    "typeql": "windows-pe-section",
    "class": "",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_ioapwyd8oimw",
    "doc_url": "",
    "summary": "The Windows PE Section type specifies metadata about a PE file section.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "windows-pebinary-ext",
    "typeql": "windows-pebinary-ext",
    "class": "WindowsPEBinaryExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_gg5zibddf9bs",
    "doc_url": "File-Windows-PE-Binary.md",
    "summary": "The Raster Image file extension specifies a default extension for capturing properties specific to raster image files. The key for this extension when used in the extensions dictionary MUST be raster-image-ext. Note that this predefined extension does not use the extension facility described in section 7.3. An object using the Raster Image File Extension MUST contain at least one property from this extension.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "windows-process-ext",
    "typeql": "windows-process-ext",
    "class": "WindowsProcessExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_oyegq07gjf5t",
    "doc_url": "Process-Windows-Process.md",
    "summary": "The Windows Process extension specifies a default extension for capturing properties specific to Windows processes. The key for this extension when used in the extensions dictionary MUST be windows-process-ext. Note that this predefined extension does not use the extension facility described in section 7.3. An object using the Windows Process Extension MUST contain at least one property from this extension.",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "windows-registry-value-type",
    "typeql": "windows-registry-value-type",
    "class": "",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_u7n4ndghs3qq",
    "doc_url": "Windows-Registry-Value.md",
    "summary": "The Windows Registry Value type captures the properties of a Windows Registry Key Value. As all properties of this type are optional, at least one of the properties defined below MUST be included when using this type. ",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "windows-service-ext",
    "typeql": "windows-service-ext",
    "class": "WindowsServiceExt",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_lbcvc2ahx1s0",
    "doc_url": "Process-Windows-Service.md",
    "summary": "The Windows Service extension specifies a default extension for capturing properties specific to Windows services. The key for this extension when used in the extensions dictionary MUST be windows-service-ext. Note that this predefined extension does not use the extension facility described in section 7.3. As all properties of this extension are optional, at least one of the properties defined below MUST be included when using this extension. ",
    "protocol": "stix21",
    "icon": ""
  },
  {
    "type":  "x509-v3-extension",
    "typeql": "x509-v3-extension",
    "class": "X509V3ExtensionsType",
    "object": "sub",
    "url": "https://docs.oasis-open.org/cti/stix/v2.1/os/stix-v2.1-os.html#_oudvonxzdlku",
    "doc_url": "X.509-Certificate Extension.md",
    "summary": "The X.509 v3 Extensions type captures properties associated with X.509 v3 extensions, which serve as a mechanism for specifying additional information such as alternative subject names. An object using the X.509 v3 Extensions type MUST contain at least one property from this type. Note that the use of the term \"extensions\" in this context refers to the X.509 v3 Extensions type and is not a STIX Cyber Observables extension. Therefore, it is a type that describes X.509 extensions.",
    "protocol": "stix21",
    "icon": ""
  }
]

